import React from 'react';
import './MainContent.css';

const MainContent = () => {
    return (
        <div className="main-content">
            <section id="home">
                <h1>ДОБРО ПОЖАЛОВАТЬ НА САЙТ ДЛЯ АВТОЛЮБИТЕЛЕЙ</h1>
            </section>
            <section className="car-images">
                <h2><center>ИЗВЕСТНЫЕ АВТО</center></h2>
                <div className="car-item">
                    <img src="/images/bmw.jpeg" alt="Авто 1" />
                    <p>BMW M1 — это легендарный спортивный автомобиль, выпускавшийся с 1978 по 1981 годы. Это был первый и единственный серийный автомобиль BMW с центральным расположением двигателя. Созданный в сотрудничестве с Lamborghini, M1 имел кузов из стеклопластика, аэродинамический дизайн и 3.5-литровый шестицилиндровый двигатель мощностью 273 л.с. Он сочетал высокую производительность с эксклюзивностью и редкостью, так как было произведено всего около 450 экземпляров. BMW M1 остается культовым представителем автомобильной истории благодаря своему уникальному дизайну и выдающимся характеристикам.</p>
                </div>
                <div className="car-item">
                    <img src="/images/ferr.jpeg" alt="Авто 2" />
                    <p>Ferrari F40 — это культовый спортивный автомобиль, выпускавшийся с 1987 по 1992 годы. Он был создан в честь 40-летия компании Ferrari и стал последним автомобилем, одобренным лично Энцо Феррари. F40 остается одним из самых знаменитых и уважаемых автомобилей в истории благодаря своему уникальному дизайну и впечатляющим характеристикам. Ferrari F40 стал символом эпохи и до сих пор остается одной из икон автомобильного мира благодаря своей экстремальной производительности, чистому дизайну и гоночной наследственности.</p>
                </div>
                <div className="car-item">
                    <img src="/images/toyota.jpg" alt="Авто 3" />
                    <p>Toyota Crown 140 — это представительский автомобиль, выпускавшийся с 1991 по 1995 годы. Он относится к девятому поколению серии Crown, известной своими комфортом, надежностью и технологичностью. Toyota Crown 140 остается популярным среди ценителей классических японских автомобилей благодаря своему сочетанию комфорта, надежности и престижного внешнего вида. Этот автомобиль является ярким примером японского инженерного мастерства и внимательного подхода к деталям.</p>
                </div>
            </section>
            <section class="forum">
                <h2>ФОРУМ</h2>
                <article class="forum-topic">
                    <h3>Какое масло лучше заливать в старое авто</h3>
                    <p>Выбор масла для старого автомобиля зависит от нескольких факторов, таких как тип двигателя, пробег, состояние двигателя и т. д. Однако, обычно для старых автомобилей рекомендуется использовать масло с более высоким уровнем вязкости (например, 10W-40 или 20W-50), так как старые двигатели могут иметь больший износ и требовать более плотного масла для лучшей смазки и защиты. Важно также учитывать рекомендации производителя автомобиля, которые можно найти в руководстве пользователя или на самом автомобиле. В любом случае, перед выбором масла лучше проконсультироваться с механиком или специалистом по обслуживанию автомобилей, чтобы убедиться, что выбранное масло подходит для вашего конкретного автомобиля.</p>
                </article>
                <article class="forum-topic">
                    <h3>Лучшие авто на 2024 год </h3>
                    <p>
                        На 2024 год выбор лучшего автомобиля будет зависеть от ваших конкретных потребностей, предпочтений и бюджета. Однако, с учетом последних тенденций и технологических разработок, некоторые критерии могут помочь определить лучшие автомобили:
                        
                        Электрические и гибридные автомобили: С ростом осознания экологических проблем и улучшением технологий электромобили и гибридные автомобили становятся все более популярными. Многие автопроизводители предлагают широкий ассортимент электромобилей различных классов и ценовых категорий.
                        
                        Автомобили с автономными функциями: Технологии автопилотирования и автоматизированного вождения становятся все более распространенными. Многие современные автомобили предлагают различные функции помощи в вождении, такие как круиз-контроль с адаптивной остановкой и стартом или системы помощи при парковке.
                        
                        Связанные с безопасностью технологии: Важными факторами становятся системы предупреждения о столкновениях, помощи при изменении полосы движения, а также системы мониторинга слепых зон и камеры заднего вида.
                        
                        Эффективность и экономичность: Рост цен на топливо и общая экологическая осознанность приводят к увеличению интереса к более экономичным и эффективным по расходу топлива автомобилям, включая гибриды и электромобили.
                        
                        Удобство и комфорт: Внимание также уделяется интерьеру автомобилей, включая качество материалов, удобство сидений, мультимедийные системы и технологии связи.
                        
                        Надежность и долговечность: Покупатели обращают внимание на репутацию бренда и рейтинги по надежности автомобилей при принятии решения.
                        
                        Несколько популярных моделей на 2024 год могут включать в себя Tesla Model 3, Toyota Prius Prime, Honda Accord Hybrid, Audi e-tron, а также некоторые новые модели, которые могли бы появиться к этому времени. Однако, рекомендуется провести собственное исследование и протестировать несколько моделей, чтобы найти наиболее подходящий автомобиль для ваших потребностей.</p>
                </article>
                <article class="forum-topic">
                    <h3>Как лучше купить машину? </h3>
                    <p>Потребительский кредит - это нецелевой кредит, предназначенный для приобретения товаров или услуг для личных нужд, включая автомобили. Автокредит, в свою очередь, выдается исключительно для покупки автомобиля и обычно требует машины в качестве залога. Вот основные различия и сходства между ними:

                        Цель: Автокредит предназначен только для покупки автомобиля, в то время как потребительский кредит может использоваться на различные цели.
                        Залог: Автокредит обычно требует автомобиль в качестве залога, в то время как потребительский кредит обычно не требует залога.
                        Ограничения на автомобиль: При автокредите автомобиль становится залогом, что влечет определенные ограничения на его использование, в то время как при потребительском кредите таких ограничений нет.
                        Страховка: При автокредите часто требуется страховка на приобретаемый автомобиль, в то время как при потребительском кредите это не обязательно.
                        Ставка: Ставка по автокредиту может быть ниже из-за наличия залога, но может повыситься без страховки. Потребительский кредит имеет свои собственные условия.
                        Одобрение и максимальная сумма: Вероятность одобрения автокредита выше, а максимальная сумма может быть больше из-за наличия залога.
                        Наконец, важно отметить, что каждый банк имеет свои условия, и льготные программы, такие как программы Минпромторга, также могут оказывать влияние на выбор между потребительским и автокредитом.</p>
                </article>
            </section>
        </div>
    );
};

export default MainContent;
